[Killed] Equality mutation
RocketLandingCoordinatorMain.cs:30:17
         {
             var platformArea = new Area(top, left, bottom, right);
 
-            if (_landingArea.Surrounds(platformArea) == false)
+            if (_landingArea.Surrounds(platformArea) != false)
             {
                 throw new PlatformOutOfBoundsException();

[Killed] Boolean mutation
RocketLandingCoordinatorMain.cs:30:57
         {
             var platformArea = new Area(top, left, bottom, right);
 
-            if (_landingArea.Surrounds(platformArea) == false)
+            if (_landingArea.Surrounds(platformArea) == true)
             {
                 throw new PlatformOutOfBoundsException();

[Killed] Negate expression
RocketLandingCoordinatorMain.cs:37:21
 
             foreach (var landingPlatform in _landingPlatforms)
             {
-                if (landingPlatform.DoesOverLap(platformArea))
+                if (!(landingPlatform.DoesOverLap(platformArea)))
                 {
                     throw new PlatformAreaOverlapException();

[Killed] Equality mutation
RocketLandingCoordinatorMain.cs:53:17
 
         public string Check(Guid rocketId, Coordinates coordinates)
         {
-            if (coordinates == null)
+            if (coordinates != null)
             {
                 return CoordinatorResponses.OUT;

[Killed] Linq method mutation (SingleOrDefault() to Single())
RocketLandingCoordinatorMain.cs:58:35
                 return CoordinatorResponses.OUT;
             }
 
-            var landingPlatform = _landingPlatforms.SingleOrDefault(lp => lp.PlatformAreaEncloses(coordinates));
+            var landingPlatform = _landingPlatforms.Single(lp => lp.PlatformAreaEncloses(coordinates));
             if (landingPlatform == null)
             {

[Killed] Equality mutation
RocketLandingCoordinatorMain.cs:59:17
             }
 
             var landingPlatform = _landingPlatforms.SingleOrDefault(lp => lp.PlatformAreaEncloses(coordinates));
-            if (landingPlatform == null)
+            if (landingPlatform != null)
             {
                 return CoordinatorResponses.OUT;
